<?php

use Illuminate\Database\Seeder;

class CountriesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $countries = $countries = [
            "Австрия"=> "AT",
            "Азербайджан"=> "AZ",
            "Албания"=> "AL",
            "Англия"=> "EN",
            "Андорра"=> "AD",
            "Армения"=> "AM",
            "Беларусь"=> "BY",
            "Бельгия"=> "BE",
            "Болгария"=> "BG",
            "Босния"=> "BA",
            "Венгрия"=> "HU",
            "Германия"=> "DE",
            "Гибралтар"=> "GI",
            "Греция"=> "GR",
            "Грузия"=> "GE",
            "Дания"=> "DK",
            "Израиль"=> "IL",
            "Ирландия"=> "IE",
            "Исландия"=> "IS",
            "Испания"=> "ES",
            "Италия"=> "IT",
            "Казахстан"=> "KZ",
            "Кипр"=> "CY",
            "Косово"=> "KS",
            "Латвия"=> "LV",
            "Литва"=> "LT",
            "Лихтенштейн"=> "LI",
            "Люксембург"=> "LU",
            "Македония"=> "MK",
            "Мальта"=> "MT",
            "Молдова"=> "MD",
            "Нидерланды"=> "NL",
            "Норвегия"=> "NO",
            "Польша"=> "PL",
            "Португалия"=> "PT",
            "Россия"=> "RU",
            "Румыния"=> "RO",
            "Сан-Марино"=> "SM",
            "Сев. Ирландия"=> "NI",
            "Сербия"=> "RS",
            "Словакия"=> "SK",
            "Словения"=> "SI",
            "Турция"=> "TR",
            "Украина"=> "UA",
            "Уэльс"=> "WL",
            "Фареры"=> "FO",
            "Финляндия"=> "FI",
            "Франция"=> "FR",
            "Хорватия"=> "HR",
            "Черногория"=> "ME",
            "Чехия"=> "CZ",
            "Швейцария"=> "CH",
            "Швеция"=> "SE",
            "Шотландия"=> "SO",
            "Эстония"=> "EE",
        ];

        foreach ($countries as $country => $code)
        {
            DB::table("countries")->insert([
                "name" => $country,
                "code" => $code,
                'created_at' => date('Y-m-d h:i:s'),
                'updated_at' => date('Y-m-d h:i:s')
            ]);
        }
    }
}
