<?php

use Illuminate\Database\Seeder;

class CountriesSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $countries = [
            "Австрия",
            "Азербайджан",
            "Албания",
            "Англия",
            "Андорра",
            "Армения",
            "Беларусь",
            "Бельгия",
            "Болгария",
            "Босния",
            "Венгрия",
            "Германия",
            "Гибралтар",
            "Греция",
            "Грузия",
            "Дания",
            "Израиль",
            "Ирландия",
            "Исландия",
            "Испания",
            "Италия",
            "Казахстан",
            "Кипр",
            "Косово",
            "Латвия",
            "Литва",
            "Лихтенштейн",
            "Люксембург",
            "Македония",
            "Мальта",
            "Молдова",
            "Нидерланды",
            "Норвегия",
            "Польша",
            "Португалия",
            "Россия",
            "Румыния",
            "Сан-Марино",
            "Сев. Ирландия",
            "Сербия",
            "Словакия",
            "Словения",
            "Турция",
            "Украина",
            "Уэльс",
            "Фареры",
            "Финляндия",
            "Франция",
            "Хорватия",
            "Черногория",
            "Чехия",
            "Швейцария",
            "Швеция",
            "Шотландия",
            "Эстония"
        ];

        foreach ($countries as $country)
        {
            DB::table("countries")->insert([
                "name" => $country,
                'created_at' => date('Y-m-d h:i:s'),
                'updated_at' => date('Y-m-d h:i:s')
            ]);
        }
    }
}
